app/controllers/api/v1/communities_controller.rb

INSERT INTO "communities" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "TestComm"], ["description", "my test community"], ["created_at", "2019-08-23 01:38:16.831638"], ["updated_at", "2019-08-23 01:38:16.831638"]]
---
  def create
    @community = Community.new(community_params)

    if @community.save