app/controllers/login_controller.rb

SELECT "logins".* FROM "logins"
---
  def index
    @logins = Login.all